app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My new portfolio"], ["subtitle", "Something Something"], ["body", "Darkside"], ["created_at", "2017-07-25 20:22:48.560790"], ["updated_at", "2017-07-25 20:22:48.560790"]]
---
  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "portfolios" SET "title" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["title", "Portfolio title: 1212"], ["updated_at", "2017-07-25 21:21:37.183080"], ["id", 5]]
---
    def update
      @portfolio_item = Portfolio.find(params[:id])

    respond_to do |format|
      if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 1]]
---
  def destroy
    # Perfom lookup
    @portfolio_item = Portfolio.find(params[:id])

    # Destroy/delete record
    @portfolio_item.destroy